; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph2 - mode
	infrared3 - mode
	infrared4 - mode
	thermograph0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation7 - direction
	Star6 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument3 infrared4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation7)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared4)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star5)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared4)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
	(supports instrument8 infrared4)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 GroundStation1)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 Planet10)
	(pointing satellite5 GroundStation2)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 infrared4)
	(have_image Planet10 spectrograph1)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 infrared3)
))

)

; plan
1. (turn_to satellite4 star5 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star5)
   goals met: 0 of 10
2. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite4 instrument5 star5)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite4 phenomenon8 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 phenomenon8)
   goals met: 0 of 10
5. (take_image satellite4 phenomenon8 instrument5 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 1 of 10
6. (turn_to satellite4 phenomenon11 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon11)
   goals met: 1 of 10
7. (turn_to satellite3 groundstation0 groundstation7)
   deleted: (pointing satellite3 groundstation7)
   added: (pointing satellite3 groundstation0)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 10
9. (turn_to satellite0 star5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star5)
   goals met: 3 of 10
10. (take_image satellite4 phenomenon11 instrument5 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 4 of 10
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
12. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 4 of 10
13. (turn_to satellite0 planet12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet12)
   goals met: 4 of 10
14. (take_image satellite0 planet12 instrument0 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 5 of 10
15. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 6 of 10
16. (turn_to satellite4 planet9 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet9)
   goals met: 6 of 10
17. (take_image satellite4 planet9 instrument5 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 7 of 10
18. (turn_to satellite4 planet10 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 planet10)
   goals met: 8 of 10
19. (take_image satellite4 planet10 instrument5 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 9 of 10
20. (turn_to satellite5 groundstation2 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 groundstation2)
   goals met: 10 of 10
